using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Tyuiu.AntonovVV.Sprint1.Task0.V29.Lib;

namespace Tyuiu.AntonovVV.Sprint1.Task29.V0
{
    class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #1 | Выполнил: Антонов В.В. | ИСПБ-24-1";
            Console.WriteLine("**************************************************************************************************************************************************");
            Console.WriteLine(" * Спринт #1 *************************************************************************************************************************************");
            Console.WriteLine("* Тема: Базовые навыки работы в С#                                                                                                               *");
            Console.WriteLine("* Задание #0                                                                                                                                     *");
            Console.WriteLine("* Вариант #29                                                                                                                                    *");
            Console.WriteLine("* Выполнил: Антонов Василий Викторович | ИСПБ-24-1                                                                                               *");
            Console.WriteLine("**************************************************************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                                                                       *");
            Console.WriteLine("* Написать программу, которая вычисляет выражение 2 * 9 + 7 * 2                                                                                  *");
            Console.WriteLine("* и печетает результат на экране.                                                                                                                *");
            Console.WriteLine("*                                                                                                                                                *");
            Console.WriteLine("**************************************************************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                                                               *");
            Console.WriteLine("**************************************************************************************************************************************************");
            Console.WriteLine("* 2 * 9 + 7 * 2                                                                                                                                  *");
            Console.WriteLine("**************************************************************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                                                     *");
            Console.WriteLine("**************************************************************************************************************************************************");

            //Метод Calculate находится в библиотеке Tyuiu.AntonovVV.Sprint1.Task0.V29.Lib
            // В классе DataService
            Console.WriteLine(ds.Calculate());

            Console.ReadKey();

        }
    }
}